more/public_html/course_2_nn_and_dl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-06 Sun 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Improving Deep Neural Networks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alex" />
<link rel="stylesheet"
             href="./css/fb.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Improving Deep Neural Networks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org905b6bb">1. Seting up ML application</a>
<ul>
<li><a href="#orgd8501dd">1.1. Data Sets</a>
<ul>
<li><a href="#orgc3caa8d">1.1.1. Ratio</a></li>
<li><a href="#org4dd48f1">1.1.2. Mismatched tain/test disriibution</a></li>
</ul>
</li>
<li><a href="#org66d807d">1.2. Bias/Variance</a></li>
<li><a href="#orgb2510dc">1.3. Basic recipe for ML</a>
<ul>
<li><a href="#orgd211a36">1.3.1. High bias</a></li>
<li><a href="#orgee04c4e">1.3.2. High variance</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4e0af87">2. Regularization</a>
<ul>
<li><a href="#org98839e2">2.1. Logistic regression</a>
<ul>
<li><a href="#org18d31d6">2.1.1. L2 Regularization</a></li>
<li><a href="#orgfc52319">2.1.2. L1 Regularization</a></li>
</ul>
</li>
<li><a href="#org56fe3c7">2.2. Neural Network</a></li>
<li><a href="#org06c88cd">2.3. How does regularization prevent overfitting?</a>
<ul>
<li><a href="#org4903456">2.3.1. Intuition 1</a></li>
<li><a href="#org1536521">2.3.2. Intuition 2</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org905b6bb" class="outline-2">
<h2 id="org905b6bb"><span class="section-number-2">1</span> Seting up ML application</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd8501dd" class="outline-3">
<h3 id="orgd8501dd"><span class="section-number-3">1.1</span> Data Sets</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Train/Dev/Test sets<br />
</p>
<ul class="org-ul">
<li>Training set<br />
Use training set on your algorithms<br /></li>
<li>Dev - Development set/ Cross Validation set<br />
Use Dev set to see which of many different models perform best on your dev set, then you get your final model<br /></li>
<li>Test set<br />
Evaluate your model on your test set to get an unbiased estimate of how well your algorithm is doing<br /></li>
</ul>
</div>

<div id="outline-container-orgc3caa8d" class="outline-4">
<h4 id="orgc3caa8d"><span class="section-number-4">1.1.1</span> Ratio</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Small amount of data(100, 1k, 10k), 60%, 20%, and 20% respectively<br /></li>
<li>Big data era(&gt; 1M), dev/test are much smaller<br />
98%, 1%, 1%, or 99.5%, 0.25%, 0.25, or 99.5%, 0.4%, 0.1%<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4dd48f1" class="outline-4">
<h4 id="org4dd48f1"><span class="section-number-4">1.1.2</span> Mismatched tain/test disriibution</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Rule of thumb:<br />
</p>
<ul class="org-ul">
<li>Make sure dev and test sets come from the same distribution.<br /></li>
<li>Your training set might come from a different distribution.<br /></li>
<li>You might be OK to not have a test set<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org66d807d" class="outline-3">
<h3 id="org66d807d"><span class="section-number-3">1.2</span> Bias/Variance</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>High bias: Underfitting the data<br /></li>
<li><p>
High variance: Overfitting the data<br />
</p>

<p>
Looking at the training set error and dev set error, you'll render a diagnosis of your algorithm having<br />
high variance or high bias.<br />
</p>

<p>
e.g. for high variance:<br />
</p>
<ul class="org-ul">
<li>train set error: 1%<br /></li>
<li>dev set error:  10%<br /></li>
</ul>

<p>
e.g. for high bias: not even fit the training set very well<br />
</p>
<ul class="org-ul">
<li>train set error: 15%<br /></li>
<li>dev set error:   16%<br /></li>
</ul>

<p>
e.g. for high bias and high variance<br />
</p>
<ul class="org-ul">
<li>train set error: 15%<br /></li>
<li>dev set error:   30%<br /></li>
</ul>

<p>
e.g. for low bias and low variance<br />
</p>
<ul class="org-ul">
<li>train set error: 0.5%<br /></li>
<li>dev set error:   1%<br /></li>
</ul>

<p>
Taking a look at your training error, you know how well you are fitting the training data, which tells you<br />
if you have a bias problem.<br />
</p>

<p>
Looking at how much higher your error goes(dev set error - train set error), that gives you a sens how bad<br />
is the variance problems.<br />
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2510dc" class="outline-3">
<h3 id="orgb2510dc"><span class="section-number-3">1.3</span> Basic recipe for ML</h3>
<div class="outline-text-3" id="text-1-3">
<p>
high biase ? Y -&gt; resolve it<br />
N -&gt; high variance? -&gt; resolve it -&gt; high bias? -&gt; Y -&gt; go back<br />
N -&gt; Done.<br />
</p>
</div>

<div id="outline-container-orgd211a36" class="outline-4">
<h4 id="orgd211a36"><span class="section-number-4">1.3.1</span> High bias</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Training data problem, try<br />
</p>
<ul class="org-ul">
<li>bigger network(more layers/units)<br /></li>
<li>train longer<br /></li>
<li>Maybe NN architecture search<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgee04c4e" class="outline-4">
<h4 id="orgee04c4e"><span class="section-number-4">1.3.2</span> High variance</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Dev set problem, try<br />
</p>
<ul class="org-ul">
<li>more data<br /></li>
<li>regularization<br /></li>
<li>Maybe NN architecture search<br /></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org4e0af87" class="outline-2">
<h2 id="org4e0af87"><span class="section-number-2">2</span> Regularization</h2>
<div class="outline-text-2" id="text-2">
<p>
&lambda; is the regularization parameter<br />
</p>
</div>
<div id="outline-container-org98839e2" class="outline-3">
<h3 id="org98839e2"><span class="section-number-3">2.1</span> Logistic regression</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org18d31d6" class="outline-4">
<h4 id="org18d31d6"><span class="section-number-4">2.1.1</span> L2 Regularization</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>J(w, b) = \(\frac{1}{m}\) \(\sum_{i=1}^{m}\) L(\(\hat{y}^{i}\), y<sup>i</sup>) + \(\frac{\lambda}{2m}\) ||w||<sup>2</sup><sub>2</sub><br /></li>
<li>||w||<sup>2</sup><sub>2</sub> = \(\sum_{j=1}^{n}\) w<sub>j</sub><sup>2</sup> = w<sup>T</sup>w<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgfc52319" class="outline-4">
<h4 id="orgfc52319"><span class="section-number-4">2.1.2</span> L1 Regularization</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>\(\frac{\lambda}{2m} \sum_{j=1}^{n}|w|_{1}\) = \(\frac{\lambda}{2m}\) ||w||<sub>1</sub><br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org56fe3c7" class="outline-3">
<h3 id="org56fe3c7"><span class="section-number-3">2.2</span> Neural Network</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>J(w<sup>[1]</sup>, b<sup>[1]</sup>, &#x2026;, w<sup>[L]</sup>, b<sup>[L]</sup>) = \(\frac{1}{m}\) \(\sum_{i=1}^{m}\) L(\(\hat{y}^{i}\), y<sup>i</sup>) + \(\frac{\lambda}{2m} \sum_{l=1}^{L}  \|w^{[l]}\|^{2}_{2}\)<br /></li>
<li>\(\|w^{[l]}\|^{2}_{F}\) = \(\sum_{i=1}^{n^{[l-1]}} \sum_{j=1}^{n^{[l]}} (w_{ij}^{[l]})^{2}\)<br />
w: (n<sup>[l-1]</sup>, n<sup>[l]</sup>)<br />
Frobenius norm<br /></li>
<li><p>
dw<sup>[l]</sup> = (from backprop) + \(\frac{\lambda}{m}\) w<sup>[l]</sup><br />
w<sup>[l]</sup> := w<sup>[l]</sup> - &alpha; dw<sup>[l]</sup><br />
         = w<sup>[l]</sup> - &alpha; [(from backprop) + \(\frac{\lambda}{m}\) w<sup>[l]</sup>]<br />
         = w<sup>[l]</sup> -  &alpha; \(\frac{\lambda}{m}\) w<sup>[l]</sup> - &alpha; (from backprop)<br />
         = (1 - \(\frac{\alpha\lambda}{m}\))w<sup>[l]</sup> - &alpha; (from backprop)<br />
</p>

<p>
L2 regrulariztion is sometimes called "Weight decay"<br />
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org06c88cd" class="outline-3">
<h3 id="org06c88cd"><span class="section-number-3">2.3</span> How does regularization prevent overfitting?</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org4903456" class="outline-4">
<h4 id="org4903456"><span class="section-number-4">2.3.1</span> Intuition 1</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Cranking up &lambda; to be very big will set W close to 0 - you can think of it as zeroing out or at least reducing<br />
the impact of hidden units, so you end up with a much simpler network, as if you were just using logistic regression,<br />
which prevents overfitting.<br />
</p>
</div>
</div>
<div id="outline-container-org1536521" class="outline-4">
<h4 id="org1536521"><span class="section-number-4">2.3.2</span> Intuition 2</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
For example, we are using tanh activation function.<br />
If &lambda; is large, then W<sup>[l]</sup> is small, then Z<sup>[l]</sup> is small - it takes on a small range of values, g(z)<br />
would be roughly linear, as if every layer would be roughtly linear, as if it's just logistic regression,<br />
then the whole network is jsut a linera network, which prevents overfitting.<br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex</p>
<p class="date">Created: 2018-05-06 Sun 18:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
